public/project.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-07-21 Fri 22:06 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta name="generator" content="Org mode" />
<meta name="author" content="krishna" />
<link rel='stylesheet' type='text/css' href='https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/css/bootstrap.min.css' />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org7a9f695">1. PROBLEM STATEMENT</a></li>
<li><a href="#orgbdc1a37">2. SOLUTION</a></li>
<li><a href="#org871a52d">3. GOALS</a></li>
<li><a href="#orgacdafce">4. DOMAINS</a></li>
<li><a href="#org31f2f01">5. USERS</a></li>
<li><a href="#orgf759c3b">6. USERS AND GOALS</a></li>
<li><a href="#org5971f2a">7. USERS RELATIONS WITH DOMAINS</a></li>
<li><a href="#org5e36490">8. USERS RELATIONS WITH OTHER USERS</a></li>
<li><a href="#org00871dc">9. DOMAIN-TO-DOMAIN-RELATIONS</a></li>
</ul>
</div>
</div>

<div id="outline-container-org7a9f695" class="outline-2">
<h2 id="org7a9f695"><span class="section-number-2">1</span> PROBLEM STATEMENT</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>The world is exploding with information. Data is being generated at a large scale, it is increasingly getting difficult to make sense of it. This problem is very acute in the financial industry because the validation of data is time sensitive in nature. Meaning the usefulness of data depends upon how fast, the data could be decoded and understood. This needs a wide variety of visualization tools, for Eg: US Payroll information can only influence markets for a limited time.</li>
</ul>
</div>
</div>

<div id="outline-container-orgbdc1a37" class="outline-2">
<h2 id="orgbdc1a37"><span class="section-number-2">2</span> SOLUTION</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>This problem requires a comprehensive visualization tool set, that could render information so that human eye can catch the anomaly easily.This visualization tool-set will compromise of the following tools
<ul class="org-ul">
<li>Histogram Visualization</li>
<li>Line chart Visualization</li>
<li>Pie chart visualization</li>
<li>Time series Data visualization</li>
</ul></li>
<li>The solution is to have a web portal where users can visit and can have information rendered.</li>
<li>This portal will primarily depends on <a href="https://www.quandl.com/tools/api">https://www.quandl.com/tools/api</a></li>
<li>We fetch data and visually render it to the users, we provide various tools to analyze the data, which includes navigation of data on time series basis and charting of data</li>
<li><span class='text-danger'>The goal is to put in a Minimum Viable Product. </span></li>
</ul>
</div>
</div>

<div id="outline-container-org871a52d" class="outline-2">
<h2 id="org871a52d"><span class="section-number-2">3</span> GOALS</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>Financial Data can be accessed easily
<ul class="org-ul">
<li>Via simple search</li>
</ul></li>
<li>Data distributors can distribute the data to the interested parties
<ul class="org-ul">
<li>will provide their api keys to us</li>
</ul></li>
<li>Consumers can visualize the data, with visualization tool set
<ul class="org-ul">
<li>visualize the data and make notes from it.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgacdafce" class="outline-2">
<h2 id="orgacdafce"><span class="section-number-2">4</span> DOMAINS</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>There are the three domains involved
<ol class="org-ol">
<li><code>Data</code>
<ul class="org-ul">
<li>Users can access variety of information
<ul class="org-ul">
<li><span class='text-success'>we will rely on Quandl Api to list the information </span></li>
</ul></li>
<li>We can list all the information that is available to us, so that they can make a choice</li>
</ul></li>
<li><code>Visualization</code> (renders data)
<ul class="org-ul">
<li>Only data that is made available</li>
</ul></li>
<li><code>Notes</code> (Users can make notes of the data)
<ul class="org-ul">
<li>User can analyze the information and can store it as a note to the visualization</li>
<li>He can come later to view it</li>
</ul></li>
<li><code>Transaction</code>
<ul class="org-ul">
<li>A consumer can request a distributor for data</li>
<li>A distribute can approve or deny the request</li>
</ul></li>
</ol></li>
</ul>
</div>
</div>

<div id="outline-container-org31f2f01" class="outline-2">
<h2 id="org31f2f01"><span class="section-number-2">5</span> USERS</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li><b>Consumers</b>
<ul class="org-ul">
<li>Can source the data as and when needed</li>
<li>Can access some open data sets</li>
<li>visualization tools available to analyze the data</li>
<li>can make notes on the data</li>
</ul></li>
<li><b>Distributors</b>
<ul class="org-ul">
<li>Can distribute the data only to users that he intends to</li>
<li>can specify which column of data goes to which visualization</li>
</ul></li>
<li><b>Admin</b>
<ul class="org-ul">
<li>Has control over consumers and distributors</li>
<li>Maintains their accounts</li>
<li>Could act as intermediary and moderate the conversations</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgf759c3b" class="outline-2">
<h2 id="orgf759c3b"><span class="section-number-2">6</span> USERS AND GOALS</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li><b>Consumers</b>
<ul class="org-ul">
<li>can access the data</li>
<li>Can visualize and analyze it</li>
<li>Can makes notes from it</li>
</ul></li>
<li><b>Distributors</b>
<ul class="org-ul">
<li>Can distribute data</li>
<li>Can set the Visualization to appeal to users</li>
<li>Can check which users bought it</li>
</ul></li>
<li><b>Admin</b>
<ul class="org-ul">
<li>Help in transactions between consumers and distributors</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org5971f2a" class="outline-2">
<h2 id="org5971f2a"><span class="section-number-2">7</span> USERS RELATIONS WITH DOMAINS</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li><b>Consumers</b>
<ul class="org-ul">
<li><code>DATA</code> : can source or access free data</li>
<li><code>Visualization</code> : can render data as a visualization</li>
<li><code>Notes</code> : can make notes of data</li>
</ul></li>
<li><b>Distributors</b>
<ul class="org-ul">
<li><code>DATA</code> : can distribute it</li>
<li><code>Visualization</code> - can specify which columns go into visualization</li>
<li>Can see who bought their data</li>
</ul></li>
<li><b>Admin</b>
<ul class="org-ul">
<li>Can specify users and manage them
<ul class="org-ul">
<li>Has full control over any data and visualization</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org5e36490" class="outline-2">
<h2 id="org5e36490"><span class="section-number-2">8</span> USERS RELATIONS WITH OTHER USERS</h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li><b>Consumers</b>
<ul class="org-ul">
<li>Can source data from Distributors</li>
<li>Will be managed by <span class='text-warning'>Admin </span></li>
<li>Users notes from the data will <code>not be available</code> to distributeers</li>
<li>Can post comments on Data</li>
</ul></li>
<li><b>Distributors</b>
<ul class="org-ul">
<li>Can Interact with consumers via comments</li>
<li>Can distribute data to Consumers</li>
<li>Will be managed by <span class='text-warning'>Admins </span></li>
</ul></li>
<li><b>Admin</b>
<ul class="org-ul">
<li>Can create consumers and distributors</li>
<li>Can moderate conversation between consumers and distributors</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org00871dc" class="outline-2">
<h2 id="org00871dc"><span class="section-number-2">9</span> DOMAIN-TO-DOMAIN-RELATIONS</h2>
<div class="outline-text-2" id="text-9">
<ul class="org-ul">
<li><code>DATA</code>
<ul class="org-ul">
<li>Will be sourced through the api</li>
</ul></li>
<li><code>Visualization</code>
<ul class="org-ul">
<li>Will consume the <code>data</code></li>
<li>Distributors can provide which column can go into the <code>visualization</code></li>
</ul></li>
<li><code>Notes</code>
<ul class="org-ul">
<li>Will be a product of  consumption of the <code>visualization</code> by the user</li>
<li>User Input is added as a note</li>
</ul></li>
<li><code>Transaction</code>
<ul class="org-ul">
<li>Recorded when Distributors authorize <code>Data</code> access to consumers</li>
<li><code>Data</code> is gets released to consumer when a transaction is successful</li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: krishna</p>
<p class="date">Created: 2017-07-21 Fri 22:06</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
